In [ ]:
# Profiling

In [15]:
import pandas as pd
import numpy as np


# df = pd.read_csv()

# df.Profile_repport()

pd.__version__

'1.0.5'

In [22]:
pd?

In [23]:
pd.<"TAB in the carrot(<>) sign">

SyntaxError: invalid syntax (<ipython-input-23-7eec84fc57c3>, line 1)

In [ ]:
# Update pandas by putting this in Anaconda prompt: conda update pandas

In [ ]:
# Pandas Series Object

In [24]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [25]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [26]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
data[1]

0.5

In [28]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [29]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [30]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [31]:
population['California']

38332521

In [32]:
population['California': 'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [33]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [ ]:
# Pandas Dataframe

In [34]:
states = pd.DataFrame({'Population':population, 'Area':area_dict})
states

            Population    Area
California    38332521  423967
Florida       19552860  170312
Illinois      12882135  149995
New York      19651127  141297
Texas         26448193  695662

In [35]:
states = pd.DataFrame(population, columns=['Populations'])
states

            Populations
California     38332521
Texas          26448193
New York       19651127
Florida        19552860
Illinois       12882135

In [36]:
pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'a':2}])

   a  b
0  1  2
1  2  3

In [37]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [38]:
ind[1]

3

In [39]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [41]:
print(ind.size, ind.shape, type(ind))

5 (5,) <class 'pandas.core.indexes.numeric.Int64Index'>

In [45]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [46]:
indA & indB   # Intersection

Int64Index([3, 5, 7], dtype='int64')

In [47]:
indA | indB   # Union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [48]:
indA ^ indB    # Symmetric different

Int64Index([1, 2, 9, 11], dtype='int64')

# Series as Dictionary

In [49]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [50]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [51]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [52]:
data['e'] = 1.25

In [53]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [55]:
data['a':'c']    # Explicit slicing, the ending index is included

a    0.25
b    0.50
c    0.75
dtype: float64

In [56]:
data[0:2]      # Implicit slicing, the ending index is NOT included

a    0.25
b    0.50
dtype: float64

In [57]:
data[['a','c']]

a    0.25
c    0.75
dtype: float64

# Indexers: loc, iloc, and ix

In [58]:
data = pd.Series(['a', 'b', 'c'], index=[1, 2, 3])

In [60]:
data[1:3]     # Implicit indexing

2    b
3    c
dtype: object

In [62]:
data.loc[1:3]   # Explicit indexing

1    a
2    b
3    c
dtype: object

In [64]:
data.iloc[1:3]   # Implicit indexing

2    b
3    c
dtype: object

# Data Selection in DataFrame

In [65]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [66]:
data['pop']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

In [67]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [68]:
data.area is data['area']

True

In [69]:
data.pop is data['pop']

False

In [71]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

# DataFrame as a Two-dimensional Array

In [72]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [74]:
data2 = data.T
data2

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [76]:
data2.columns

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [77]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [79]:
data.loc[:'Florida', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860

In [80]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121